# Object Creation

In [66]:
import numpy as np
import pandas as pd

s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [61]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [63]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.433814 -0.296954  0.962654 -0.033207
2013-01-02  0.977283  1.005128  1.521164 -0.819661
2013-01-03 -1.381540  0.626233  1.600499  1.417249
2013-01-04  0.613913  0.528560 -1.282070 -0.445877
2013-01-05 -1.554401 -0.677080  1.404084 -0.012042
2013-01-06 -0.414693 -2.019194  0.381515 -0.374178

In [64]:
df2 = pd.DataFrame({'A':1., 'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D':np.array([3]*4, dtype='int32'),
                   'E':pd.Categorical(['test','train','test','train']),
                   'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [65]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing data

In [70]:
df.head()

                   A         B         C         D
2013-01-01 -1.433814 -0.296954  0.962654 -0.033207
2013-01-02  0.977283  1.005128  1.521164 -0.819661
2013-01-03 -1.381540  0.626233  1.600499  1.417249
2013-01-04  0.613913  0.528560 -1.282070 -0.445877
2013-01-05 -1.554401 -0.677080  1.404084 -0.012042

In [71]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.613913  0.528560 -1.282070 -0.445877
2013-01-05 -1.554401 -0.677080  1.404084 -0.012042
2013-01-06 -0.414693 -2.019194  0.381515 -0.374178

In [72]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [73]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [76]:
df.to_numpy()

array([[-1.43381362, -0.29695424,  0.962654  , -0.03320706],
       [ 0.97728332,  1.00512764,  1.52116382, -0.81966082],
       [-1.38153953,  0.62623299,  1.60049909,  1.4172487 ],
       [ 0.61391306,  0.52856019, -1.28207022, -0.44587726],
       [-1.55440077, -0.67707993,  1.40408367, -0.01204186],
       [-0.41469333, -2.01919399,  0.38151485, -0.37417794]])

In [77]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [79]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.532208 -0.138885  0.764641 -0.044619
std    1.112214  1.112641  1.100445  0.775700
min   -1.554401 -2.019194 -1.282070 -0.819661
25%   -1.420745 -0.582049  0.526800 -0.427952
50%   -0.898116  0.115803  1.183369 -0.203692
75%    0.356761  0.601815  1.491894 -0.017333
max    0.977283  1.005128  1.600499  1.417249

In [80]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.433814    0.977283   -1.381540    0.613913   -1.554401   -0.414693
B   -0.296954    1.005128    0.626233    0.528560   -0.677080   -2.019194
C    0.962654    1.521164    1.600499   -1.282070    1.404084    0.381515
D   -0.033207   -0.819661    1.417249   -0.445877   -0.012042   -0.374178

In [81]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.033207  0.962654 -0.296954 -1.433814
2013-01-02 -0.819661  1.521164  1.005128  0.977283
2013-01-03  1.417249  1.600499  0.626233 -1.381540
2013-01-04 -0.445877 -1.282070  0.528560  0.613913
2013-01-05 -0.012042  1.404084 -0.677080 -1.554401
2013-01-06 -0.374178  0.381515 -2.019194 -0.414693

In [83]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -0.414693 -2.019194  0.381515 -0.374178
2013-01-05 -1.554401 -0.677080  1.404084 -0.012042
2013-01-01 -1.433814 -0.296954  0.962654 -0.033207
2013-01-04  0.613913  0.528560 -1.282070 -0.445877
2013-01-03 -1.381540  0.626233  1.600499  1.417249
2013-01-02  0.977283  1.005128  1.521164 -0.819661

# Selection

In [84]:
df['A']

2013-01-01   -1.433814
2013-01-02    0.977283
2013-01-03   -1.381540
2013-01-04    0.613913
2013-01-05   -1.554401
2013-01-06   -0.414693
Freq: D, Name: A, dtype: float64

In [85]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.433814 -0.296954  0.962654 -0.033207
2013-01-02  0.977283  1.005128  1.521164 -0.819661
2013-01-03 -1.381540  0.626233  1.600499  1.417249

In [86]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.977283  1.005128  1.521164 -0.819661
2013-01-03 -1.381540  0.626233  1.600499  1.417249
2013-01-04  0.613913  0.528560 -1.282070 -0.445877

## selection by label

In [88]:
df.loc[dates[0]]

A   -1.433814
B   -0.296954
C    0.962654
D   -0.033207
Name: 2013-01-01 00:00:00, dtype: float64

In [91]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.433814 -0.296954
2013-01-02  0.977283  1.005128
2013-01-03 -1.381540  0.626233
2013-01-04  0.613913  0.528560
2013-01-05 -1.554401 -0.677080
2013-01-06 -0.414693 -2.019194

In [93]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.977283  1.005128
2013-01-03 -1.381540  0.626233
2013-01-04  0.613913  0.528560

In [94]:
df.loc[dates[0], 'A']

-1.433813618560017

In [95]:
df.at[dates[0], 'A']

-1.433813618560017

## Selection by position

In [101]:
df.iloc[3]

A    0.613913
B    0.528560
C   -1.282070
D   -0.445877
Name: 2013-01-04 00:00:00, dtype: float64

In [102]:
df.iloc[3:5,0:2]

                   A        B
2013-01-04  0.613913  0.52856
2013-01-05 -1.554401 -0.67708

In [104]:
df.iloc[[2,3,5],[0,2]]

                   A         C
2013-01-03 -1.381540  1.600499
2013-01-04  0.613913 -1.282070
2013-01-06 -0.414693  0.381515

In [106]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.977283  1.005128  1.521164 -0.819661
2013-01-03 -1.381540  0.626233  1.600499  1.417249

In [107]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.296954  0.962654
2013-01-02  1.005128  1.521164
2013-01-03  0.626233  1.600499
2013-01-04  0.528560 -1.282070
2013-01-05 -0.677080  1.404084
2013-01-06 -2.019194  0.381515

In [108]:
df.iloc[1,1]

1.0051276405523761

In [109]:
df.iat[1,1]

1.0051276405523761

# Boolean indexing

In [113]:
df[df.A>0]

                   A         B         C         D
2013-01-02  0.977283  1.005128  1.521164 -0.819661
2013-01-04  0.613913  0.528560 -1.282070 -0.445877

In [114]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.962654       NaN
2013-01-02  0.977283  1.005128  1.521164       NaN
2013-01-03       NaN  0.626233  1.600499  1.417249
2013-01-04  0.613913  0.528560       NaN       NaN
2013-01-05       NaN       NaN  1.404084       NaN
2013-01-06       NaN       NaN  0.381515       NaN

In [117]:
df2 = df.copy()

In [119]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -1.433814 -0.296954  0.962654 -0.033207    one
2013-01-02  0.977283  1.005128  1.521164 -0.819661    one
2013-01-03 -1.381540  0.626233  1.600499  1.417249    two
2013-01-04  0.613913  0.528560 -1.282070 -0.445877  three
2013-01-05 -1.554401 -0.677080  1.404084 -0.012042   four
2013-01-06 -0.414693 -2.019194  0.381515 -0.374178  three

# Setting

In [120]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [125]:
df.at[dates[0], 'A'] = 0

0.0

In [126]:
df.iat[0,1] = 0

In [127]:
df.loc[:,'D'] = np.array([5]*len(df))

In [128]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.962654  5
2013-01-02  0.977283  1.005128  1.521164  5
2013-01-03 -1.381540  0.626233  1.600499  5
2013-01-04  0.613913  0.528560 -1.282070  5
2013-01-05 -1.554401 -0.677080  1.404084  5
2013-01-06 -0.414693 -2.019194  0.381515  5

In [130]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.962654 -5
2013-01-02 -0.977283 -1.005128 -1.521164 -5
2013-01-03 -1.381540 -0.626233 -1.600499 -5
2013-01-04 -0.613913 -0.528560 -1.282070 -5
2013-01-05 -1.554401 -0.677080 -1.404084 -5
2013-01-06 -0.414693 -2.019194 -0.381515 -5

# missing data

In [133]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.962654  5  1.0
2013-01-02  0.977283  1.005128  1.521164  5  1.0
2013-01-03 -1.381540  0.626233  1.600499  5  NaN
2013-01-04  0.613913  0.528560 -1.282070  5  NaN

In [134]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.962654  5  1.0
2013-01-02  0.977283  1.005128  1.521164  5  1.0

In [135]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.962654  5  1.0
2013-01-02  0.977283  1.005128  1.521164  5  1.0
2013-01-03 -1.381540  0.626233  1.600499  5  5.0
2013-01-04  0.613913  0.528560 -1.282070  5  5.0

In [136]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

# operations

In [137]:
df.mean()

A   -0.293240
B   -0.089392
C    0.764641
D    5.000000
dtype: float64

In [138]:
df.mean(1)

2013-01-01    1.490663
2013-01-02    2.125894
2013-01-03    1.461298
2013-01-04    1.215101
2013-01-05    1.043151
2013-01-06    0.736907
Freq: D, dtype: float64

In [142]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [143]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -2.381540 -0.373767  0.600499  4.0
2013-01-04 -2.386087 -2.471440 -4.282070  2.0
2013-01-05 -6.554401 -5.677080 -3.595916  0.0
2013-01-06       NaN       NaN       NaN  NaN

# apply

In [144]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  0.962654   5
2013-01-02  0.977283  1.005128  2.483818  10
2013-01-03 -0.404256  1.631361  4.084317  15
2013-01-04  0.209657  2.159921  2.802247  20
2013-01-05 -1.344744  1.482841  4.206330  25
2013-01-06 -1.759437 -0.536353  4.587845  30

In [146]:
df.apply(lambda x: x.max()-x.min())

A    2.531684
B    3.024322
C    2.882569
D    0.000000
dtype: float64

# histogramming

In [151]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    2
2    1
3    1
4    4
5    3
6    0
7    3
8    6
9    6
dtype: int32

In [152]:
s.value_counts()

6    2
3    2
2    2
1    2
4    1
0    1
dtype: int64

# String Methods

In [158]:
s = pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','dog','cat'])
s = s.str.lower()

In [159]:
s.str.count('a')

0    1.0
1    0.0
2    0.0
3    3.0
4    2.0
5    NaN
6    2.0
7    0.0
8    1.0
dtype: float64

# merge

## concat

In [160]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -1.259232 -1.053131 -0.118957  0.598461
1  1.418801  0.577728 -0.384988  0.517793
2  1.852025 -0.745125  0.654664  0.663607
3  0.338028  0.053388 -0.211635  0.785596
4  0.107316  0.288134  0.128984 -0.388169
5 -0.965753 -0.151322  0.749113 -0.044102
6  0.057778  0.130661  0.368283  0.320218
7 -0.747450  0.736884  1.019325  0.944848
8  2.206102  2.691870  1.364204 -1.593924
9 -0.777630 -2.362944 -1.460008 -0.504517

In [161]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -1.259232 -1.053131 -0.118957  0.598461
1  1.418801  0.577728 -0.384988  0.517793
2  1.852025 -0.745125  0.654664  0.663607
3  0.338028  0.053388 -0.211635  0.785596
4  0.107316  0.288134  0.128984 -0.388169
5 -0.965753 -0.151322  0.749113 -0.044102
6  0.057778  0.130661  0.368283  0.320218
7 -0.747450  0.736884  1.019325  0.944848
8  2.206102  2.691870  1.364204 -1.593924
9 -0.777630 -2.362944 -1.460008 -0.504517

## join

In [167]:
left = pd.DataFrame({'key':['foo','foo'], 'lval':[1,2]})
right = pd.DataFrame({'key':['foo','foo'], 'rval':[4,5]})
left
right

   key  rval
0  foo     4
1  foo     5

In [165]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [168]:
left = pd.DataFrame({'key':['foo','bar'], 'lval':[1,2]})
right = pd.DataFrame({'key':['foo','bar'], 'rval':[4,5]})
left
right

   key  lval
0  foo     1
1  bar     2

In [170]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

# append

In [171]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.128295 -0.507472 -1.193952  1.333284
1  1.215287  1.461698 -0.513530 -0.680077
2 -1.500639 -0.476241 -0.193649 -1.467754
3  0.032248 -1.264605  1.353923  0.476053
4  0.303915  0.111987 -2.666609 -0.483552
5  2.649726 -0.529320 -2.173734  0.378786
6  0.129376 -0.218009  1.631481  0.000118
7 -0.459879 -1.509472  0.140799 -1.296494

In [172]:
s = df.iloc[3]

In [173]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.128295 -0.507472 -1.193952  1.333284
1  1.215287  1.461698 -0.513530 -0.680077
2 -1.500639 -0.476241 -0.193649 -1.467754
3  0.032248 -1.264605  1.353923  0.476053
4  0.303915  0.111987 -2.666609 -0.483552
5  2.649726 -0.529320 -2.173734  0.378786
6  0.129376 -0.218009  1.631481  0.000118
7 -0.459879 -1.509472  0.140799 -1.296494
8  0.032248 -1.264605  1.353923  0.476053

# grouping

In [174]:
df = pd.DataFrame({'A':['foo','bar','foo','bar',
                       'foo','bar','foo','foo'],
                  'B':['one','one','two','three',
                      'two','two','one','tjree'],
                  'C':np.random.randn(8),
                  'D':np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.395466  0.901746
1  bar    one -0.691891 -0.852241
2  foo    two  1.184361  0.476543
3  bar  three -2.237124  0.256602
4  foo    two  0.666524  1.212280
5  bar    two  2.777210 -1.181796
6  foo    one  0.432718 -0.804875
7  foo  tjree -0.525210  0.987305

In [177]:
df.groupby('A').sum()

            C         D
A
bar -0.151806 -1.777435
foo  1.362927  2.772999

In [179]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.691891 -0.852241
    three -2.237124  0.256602
    two    2.777210 -1.181796
foo one    0.037252  0.096871
    tjree -0.525210  0.987305
    two    1.850885  1.688823

# reshaping

## stack

In [184]:
tuples = list(zip(*[['bar','bar','baz','baz',
                    'foo','foo','qux','qux'],
                   ['one','two','one','two',
                   'one','two','one','two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [185]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=['A','B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one    -3.445264 -0.450292
      two     0.550270  1.282662
baz   one    -0.269637 -2.061875
      two    -0.281804  1.500735

In [186]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -3.445264
               B   -0.450292
       two     A    0.550270
               B    1.282662
baz    one     A   -0.269637
               B   -2.061875
       two     A   -0.281804
               B    1.500735
dtype: float64

In [188]:
stacked.unstack()

                     A         B
first second
bar   one    -3.445264 -0.450292
      two     0.550270  1.282662
baz   one    -0.269637 -2.061875
      two    -0.281804  1.500735

In [189]:
stacked.unstack(1)

second        one       two
first
bar   A -3.445264  0.550270
      B -0.450292  1.282662
baz   A -0.269637 -0.281804
      B -2.061875  1.500735

In [190]:
stacked.unstack(0)

first          bar       baz
second
one    A -3.445264 -0.269637
       B -0.450292 -2.061875
two    A  0.550270 -0.281804
       B  1.282662  1.500735

# Pivot tables

In [ ]:
df = pd.DataFrame({'A':['one','one','two','three']*3,
                  'B':['A','B','C']})